src/DataProcessors/ГрупповоеИзменениеЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ГрупповоеИзменениеЦен</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Documents/УстановкаЦенНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>УстановкаЦенНоменклатуры</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЦеныНоменклатуры</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЦены</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/DataProcessors/ГрупповоеИзменениеЦен/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ИзменитьЦены(Команда)
	Если ПроверитьЗаполнение() Тогда
		ИзменитьЦеныНаСервере();
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ИзменитьЦеныНаСервере()
    
    ТаблицаЦен = ПолучитьАктуальныеЦены();
    
    Если ТаблицаЦен.Количество() = 0 Тогда
        Сообщение = Новый СообщениеПользователю;
        Сообщение.Текст = "По указанной группе " + ГруппаНоменклатур + " и Виду цен " + ВидЦены + " не найдено установленных цен!";
        Сообщение.Сообщить();
        Возврат;
    КонецЕсли;
    
    СоздатьДокументУстановкиЦен(ТаблицаЦен);
    
КонецПроцедуры

&НаСервере
Функция ПолучитьАктуальныеЦены()
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
    |	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
    |ИЗ
    |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних КАК ЦеныНоменклатурыСрезПоследних
    |ГДЕ
    |	ЦеныНоменклатурыСрезПоследних.ВидЦены = &ВидЦены
    |	И ЦеныНоменклатурыСрезПоследних.Номенклатура В ИЕРАРХИИ(&ГруппаНоменклатур)";
    
    Запрос.УстановитьПараметр("ВидЦены", ВидЦены);
    Запрос.УстановитьПараметр("ГруппаНоменклатур", ГруппаНоменклатур);
    
    Результат = Запрос.Выполнить();
    Возврат Результат.Выгрузить();
    
КонецФункции

&НаСервере
Процедура СоздатьДокументУстановкиЦен(ТаблицаЦен)
    
    НовыйДокумент = Документы.УстановкаЦенНоменклатуры.СоздатьДокумент();
    
    НовыйДокумент.Дата = ДатаДействияНовойЦены;
    НовыйДокумент.Комментарий = "Изменение цен на " + ПроцентИзменения + "%. Документ создан обработкой группового изменений цен";
    
    ТабличнаяЧасть = НовыйДокумент.Товары;
    
    Для Каждого СтрокаЦены Из ТаблицаЦен Цикл
        НоваяСтрока = ТабличнаяЧасть.Добавить();
        НоваяСтрока.Номенклатура = СтрокаЦены.Номенклатура;
		НоваяСтрока.ВидЦены = ВидЦены;
        НоваяСтрока.Цена = СтрокаЦены.Цена * (1 + ПроцентИзменения / 100);
    КонецЦикла;
    
    НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
	ДокументУстановкиЦен = НовыйДокумент.Ссылка;
    
КонецПроцедуры
